app/Http/Controllers/Api/Auth/LoginController.php

select * from `users` where `email` = 'admin4@gmail.com' limit 1
---
     public function __invoke(LoginRequest $request)
    {
        $user = User::where("email", $request->email)->first();