app/Http/Controllers/Api/Auth/RegisterController.php

     public function __invoke(RegisterRequest $request)
    {
       //$validated = $request->validated();

    //    $user = User::create($validated);
        // $user =  $this->model->create([
        //     ...$validated,
        //     'password' => bcrypt($request->password),
        // ]);


        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => bcrypt($request->password),
        ]);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('admin4', 'admin4@gmail.com', '$2y$12$s/pasmzTt5.jl5BIkXGRIOQilDknJu02ZB1wXuIouSdxadGwNHZhe', '2024-01-17 17:58:22', '2024-01-17 17:58:22')